{
  "Telegram Mini App. Как создать Web App с нуля": {
    "time": "2024-08-25, 15:51",
    "href": "https://habr.com/ru/companies/amvera/articles/838180/",
    "description": "Mini Apps (или же WebApps) - это относительно новый и удобный способ добавления веб приложения прямо в интерфейсе приложения Telegram. Используя JavaScript, становится  возможным создавать бесконечное множество интерфейсов, которые смогут заменить полноценный веб-сайт.Особенность MiniApps заключается в том, что они поддерживают авторизацию, платежи одной кнопкой и возможность работать с данными пользователя, открывшего мини-приложение.И сегодня мы попробуем создать miniapp приложение, взаимодействующее с данными пользователя. Приступим"
  },
  "Работа с API YandexART на Python": {
    "time": "2024-08-25, 11:42",
    "href": "https://habr.com/ru/articles/838354/",
    "description": "Всем привет!Вчера делал интеграцию YandexART в своего юзербота, не нашел инструкций на Хабре, слава богу решил проблему сам, но я подумал что всё-таки надо поделиться способом интеграции."
  },
  "Пираты, загадки и юмор: Как The Curse of Monkey Island покорила сердца геймеров": {
    "time": "2024-08-25, 10:05",
    "href": "https://habr.com/ru/companies/timeweb/articles/838126/",
    "description": "\n\r\nКогда разговор заходит о культовых играх 90-х, одна из них неизменно вызывает теплоту в сердцах геймеров и ностальгические воспоминания о днях давно ушедших – The Curse of Monkey Island. Третья часть легендарной серии приключенческих игр, вышедшая в 1997 году, подарила поклонникам еще одно незабываемое путешествие по Карибскому морю, полному пиратов, магии, и, конечно же, множество интересных загадок. Разработанный компанией LucasArts проект не просто стал продолжением истории о Гайбраше Трипвуде, но и важным этапом в развитии жанра point-and-click квестов. Формула успеха этой игры довольно проста: очаровательная рисовка, множество забавных персонажей и юмор, заставляющий как минимум улыбнуться. Всё это помножено на интересную историю с множеством головоломок и чарующей музыкой. А что ещё нужно для счастья?\n\r\nГрафически The Curse of Monkey Island выглядела как оживший мультфильм. В эпоху, когда 3D-графика набирала популярность и все поголовно пытались перевести свои игры на новые рельсы, LucasArts пошли против течения, выбрав красочные 2D-спрайты. Эта рисованная графика придала игре неповторимый стиль, который сохраняет свое очарование даже сегодня. Особенно запоминаются насыщенные цвета и детализированные задники, которые буквально затягивают в это красочное приключение.\n\r\nПриглашаю вас погрузиться в захватывающий мир пиратов, магии и увлекательных загадок, и вместе вспомнить, почему эта игра завоевала сердца геймеров по всему миру и остается актуальной даже в 2024 году! В конце статьи я поделюсь различными дополнительными материалами, а также ссылкой на сборку игры, чтобы вы могли лично возродить свои ностальгические эмоции."
  },
  "Он был не таким: смотрим на HP Veer. Какой смартфон выпустила HP во времена iPhone 4?": {
    "time": "2024-08-24, 17:06",
    "href": "https://habr.com/ru/companies/timeweb/articles/837704/",
    "description": "Друзья! Мы уже успели с вами рассмотреть некоторые смартфоны на самых разных и редких  Web-based платформах, таких как Bada, FireFox OS и конечно-же KaiOS. Однако сегодняшний девайс особо выделяется за счёт того, что использует операционную систему HP webOS (предок той самой LG webOS в SmartTV), а также своей миниатюронстью и наличию полноценной, и главное удобной QWERTY-клавиатуры в формате слайдера. Когда-то компания Palm (и купившая её HP) работали над своим собственным видением современного смартфона и несмотря на то что выпустили лишь пару несколько устройств, сделали по истине крутой девайс. Недавно подписчик подарил мне HP Veer 4G, на которой мы с вами посмотрим в сегодняшней статье. Интересно? Тогда добро пожаловать под кат!"
  },
  "Проблема альтернативной реализации": {
    "time": "2024-08-23, 22:29",
    "href": "https://habr.com/ru/companies/sportmaster_lab/articles/838194/",
    "description": "\r\nВ этом посте я бы хотел порассуждать о тенденции, которую постоянно наблюдаю в мире разработки ПО. На самом деле, я бы даже рискнул сказать, что подобная ситуация происходит и в мире оборудования, но буду рассматривать только программные системы, потому что работаю с ними. В этой обсуждении я затрону человеческую психологию и опишу распространённую ловушку, которой вы, надеюсь, сможете избежать."
  },
  "Создание опросников на Python с использованием aiogram 2.x": {
    "time": "2024-08-23, 22:01",
    "href": "https://habr.com/ru/articles/838190/",
    "description": "В мире разработки чат-ботов на платформе Telegram создание интерактивных опросников может быть задачей нетривиальной. В этом посте я поделюсь системой, которую разработал на основе библиотеки aiogram 2.x. Она позволяет легко создавать и обрабатывать опросники с текстовыми ответами и вариантами выбора, а также управлять состояниями бота. В статье мы разберем ключевые аспекты реализации, включая обработку состояний, сохранение ответов и управление сообщениями."
  },
  "Ускорили диффузионку в несколько раз? – о новой модели ImagineFlash от Meta": {
    "time": "2024-08-23, 19:05",
    "href": "https://habr.com/ru/articles/838160/",
    "description": "Важно, что в переводе статьи мы опустили некоторые математические подробности. Мы обобщили математические выражения текстом. Курсивом выделены комментарии, чтобы новичкам было проще читать, а выделенный уровень подготовки  оправдывал себя и под статьей не пришлось ставить графу “сложно”. Чтобы статья не вышла слишком большой, приводится ее основная часть с методом. Мы приводим краткий вариант перевода ресерча от Meta.Внутри оригинала можно ознакомиться с результатами работы. И конкретными метриками в таблицах. Вся статья сохраняет письмо от первого лица. "
  },
  "Что будет на PiterPy 2024: ML, JAX, JIT, GC, BDUI и другие увлекательные аббревиатуры": {
    "time": "2024-08-23, 17:29",
    "href": "https://habr.com/ru/companies/jugru/articles/838014/",
    "description": "Устарели ли NumPy и PyTorch? Как перевести проект с Python 2 на Python 3 так, чтобы пользователи не заметили? Как дать языковой модели доступ к данным, которых не было в обучающем датасете?В сентябре мы проведём конференцию PiterPy 2024, где поговорят обо всех этих вопросах и многих других. Все описания докладов уже есть на сайте, а теперь для Хабра мы свели их в один текст, подсократили в нём длинные описания, перевели на русский англоязычные."
  }
}